# Where Pandas name came from?

* Word pandas came from  panel data
* Panel Data is Multidimensional data involving measurement over time

* Pandas was created by Wes Mckiney


### Features of Pandas:

* Series Object and DataFrame
* Handling of Missing Data
* Data Alignment 
* Group by Functionality
* Slicing Indexing and Subsetting
* Merging and Joining
* Reshaping
* Hierrachiecal labelling of axes
* Robust Input Output Tool
* Time Series Specific functionality


## Pandas v/s Numpy

* Pandas perform Better while dealing with 500k rows or more

* Numpy performs better for 50k or less


* Pandas Series Object is more flexible you can define your label
  index and acess elements for array
  
* Elements in Numpy arrays  acessed by their                                                                                      default integer position
  
  
# How to import pandas 
  * import pandas as pd


# What kind of data does suit pandas:
* Tabular Data
* Arbitrary Matrix
* Time Series Data

# Series Object in Pandas

* what are different types of data set in Pandas
* What is Series Object 
* How to create a Series Object
* How to Check type
* how to check index name 

# Datset in Pandas

* One Dimensional 
* two Dimensional

* 1D - Series Object
* 2D - DataFrame
* 3D - Panel Data

# What is  Series Object ?

* One Dimensional Labelled Array
* Contains Data of Similar or mixed

In [3]:
#Example 

import pandas as pd
data = [1,2,3,4]
series1 = pd.Series(data)
series1

0    1
1    2
2    3
3    4
dtype: int64

# How to Check the type

In [6]:
type(series1)

pandas.core.series.Series

In [9]:
#Changing index of Series object

series1 = pd.Series(data,index=['a','b','c','d'])
series1

a    1
b    2
c    3
d    4
dtype: int64

# Creating Different Series Object Data Types

* Use Array, Dictionary,List,Scalar or constant

# Pandas DataFrame

* What is DataFrame?
* What are various Features in DataFrame

# what is DataFrame?
* Two Dimensional Labeled Data Structures
  with columns of potentially Data types

# Features of DataFrame:
* Different Column types :
* Mutable Size 
* Labelled Axis
* Aritmetic operations on Rows and Columns

# how to create DataFrame

* pd.DataFrame(data)

In [11]:

#creating an dataframe by using a list
import pandas as pd
data = [1,2,3,4,5]
df = pd.DataFrame(data)
df

   0
0  1
1  2
2  3
3  4
4  5

In [14]:
#Create a  dataframe by using dictionary

dict = {'fruits':["Apple","Banana","Mangoes"],'count':[10,20,15]}
df = pd.DataFrame(dict)
df

    fruits  count
0    Apple     10
1   Banana     20
2  Mangoes     15

In [15]:
#creating an DataFrame by using series

series = pd.Series([6,13],index=['a','b'])
df = pd.DataFrame(series)
df

    0
a   6
b  13

In [18]:
#creating a dataframe using numpy array
import numpy as np
numpyarray = np.array([[50000,60000],['john','james']])
df =  pd.DataFrame({'name':numpyarray[1],'salary':numpyarray[0]})
df

    name salary
0   john  50000
1  james  60000

# Merge Join and Concatenate
* how to do merge operation using pandas

In [42]:
# first import library
# then create list

import pandas as pd

player = ['player1','player2','player3']
point = [8,9,6]
title=['game1','game2','game3']
df1 = pd.DataFrame({'players':player,'points':point,'Title':title})
df1

   players  points  Title
0  player1       8  game1
1  player2       9  game2
2  player3       6  game3

In [43]:
player = ['player1','player6','player7']
power = ['punch','kick','elbow']
title = ['game1','game5','game6']

df2 = pd.DataFrame({'players':player,'powers':power,'Title':title})
df2

   players powers  Title
0  player1  punch  game1
1  player6   kick  game5
2  player7  elbow  game6

In [46]:
#inner merge
df1.merge(df2)
#parameters:, on ='Title',how ='inner'

   players  points  Title powers
0  player1       8  game1  punch

In [48]:
#left merge
df1.merge(df2,on='players',how='left')

   players  points Title_x powers Title_y
0  player1       8   game1  punch   game1
1  player2       9   game2    NaN     NaN
2  player3       6   game3    NaN     NaN

In [49]:
#right merge
df1.merge(df2,on='players',how='right')

   players  points Title_x powers Title_y
0  player1     8.0   game1  punch   game1
1  player6     NaN     NaN   kick   game5
2  player7     NaN     NaN  elbow   game6

In [50]:
#outer merge
df1.merge(df2,on='players',how='outer')

   players  points Title_x powers Title_y
0  player1     8.0   game1  punch   game1
1  player2     9.0   game2    NaN     NaN
2  player3     6.0   game3    NaN     NaN
3  player6     NaN     NaN   kick   game5
4  player7     NaN     NaN  elbow   game6

In [51]:
#how to perform join operation in pandas
player = ['player1','player6','player7']
power = ['punch','kick','elbow']
title = ['game1','game5','game6']

df3 = pd.DataFrame({'players':player,'powers':power,'Title':title},index=['L2','L3','L4'])
df3

    players powers  Title
L2  player1  punch  game1
L3  player6   kick  game5
L4  player7  elbow  game6

# importing and analyzing an dataset